Tekla.Structures.Plugins.DirectManipulation.Services.Tools.TextManipulation.DimensionTextManipulator
The Tekla.Structures.Plugins.DirectManipulation.Services.Tools.TextManipulation.DimensionTextManipulator class defines a manipulator to display and manipulate dimension value text.

Tekla.Structures.Plugins.DirectManipulation.Services.Tools.TextManipulation.DimensionTextManipulator.#ctor(Tekla.Structures.Plugins.DirectManipulation.Core.ManipulationContext,Tekla.Structures.Geometry3d.LineSegment,Tekla.Structures.Geometry3d.LineSegment,Tekla.Structures.Plugins.DirectManipulation.Services.Tools.TextManipulation.DimensionTextManipulator.InputDirections)
Initializes a new instance of the Tekla.Structures.Plugins.DirectManipulation.Services.Tools.TextManipulation.DimensionTextManipulator class.
manipulationContext: The manipulation context.
placement: The placement of the text manipulator.
initialDimension: The initial dimension.
inputDirection: The initial input direction.

Tekla.Structures.Plugins.DirectManipulation.Services.Tools.TextManipulation.DimensionTextManipulator.DimensionEntered
Invoked when a dimension has been entered.

Tekla.Structures.Plugins.DirectManipulation.Services.Tools.TextManipulation.DimensionTextManipulator.Dimension
Gets or sets the line segment that represents the dimension.

Tekla.Structures.Plugins.DirectManipulation.Services.Tools.TextManipulation.DimensionTextManipulator.InputDirectionArrows
Gets or sets the input direction arrows value.

Tekla.Structures.Plugins.DirectManipulation.Services.Tools.TextManipulation.DimensionTextManipulator.AttachHandlers


Tekla.Structures.Plugins.DirectManipulation.Services.Tools.TextManipulation.DimensionTextManipulator.DetachHandlers


Tekla.Structures.Plugins.DirectManipulation.Services.Tools.TextManipulation.DimensionTextManipulator.OnDimensionEntered(System.Object,Tekla.BIM.DirectManipulation.Services.Interaction.DimensionInput)
Event handler for the dimension entered event.
sender: The sender object.
eventArgs: The event arguments.